Revit 2026 API

# RebarConstraintGetPositiveOffsetDirectionForToOtherRebarConstraint Method

---

Returns the positive offset direction vector.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetPositiveOffsetDirectionForToOtherRebarConstraint()
```
```vb
Public Function GetPositiveOffsetDirectionForToOtherRebarConstraint As XYZ
```
```cpp
public:
XYZ^ GetPositiveOffsetDirectionForToOtherRebarConstraint()
```
```fsharp
member GetPositiveOffsetDirectionForToOtherRebarConstraint : unit -> XYZ
```

#### Return Value

XYZ The positive offset direction vector.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The TargetRebarConstraintType is not valid. |

This is available only for constraints of type ToOtherRebar.

Valid TargetRebarConstraintType are:

  * RebarPlane
  * Edge
  * OutOfPlaneExtent
  * StartOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsStartConnectorPressent]
  * EndOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsEndConnectorPressent]

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace